<?php

namespace App;

use Illuminate\Database\Eloquent\Model;

class Micropost extends Model
{
    protected $fillable = ['content'];
    
    /* ----------------------------------------------------------- *
     * この投稿を所有するユーザー（Userモデルとの関係を定義）
    * ----------------------------------------------------------- */
    public function user(){
        return $this->belongsTo(User::class);
    }
    
    /* ----------------------------------------------------------- *
     * この投稿をお気に入り登録中のユーザー（Userモデルとの関係を定義）
     * ----------------------------------------------------------- */
    public function favorite_users(){
        /* --------------------------------------------------------------------------------------------- *
         * belongsToMany()
         * 第一引数：相手先モデル
         * 第二引数：結合テーブル（中間テーブル）
         * 第三引数：指定した相手先モデルが参照に利用しているこっちのカラム名
         * 第四引数：指定した相手先モデル側がこの関数へ参照を持つために利用しているあっちのカラム名
         * --------------------------------------------------------------------------------------------- */
        return $this->belongsToMany(User::class, 'favorites', 'micropost_id', 'user_id')->withTimestamps();
    }
    
    
}
